# 2) შემოატანინეთ მომხმარებელს რიცხვი 1-დან 12ჩათვლით:
# თუ ეს რიცხვი არის 12, 1, 2 -> დაპრინტეთ ზამთარი
# თუ ეს რიცხვი არის 3, 4, 5 -> დაპრინტეთ გაზაფხული
# თუ ეს რიცხვი არის 6, 7, 8 -> დაპრინტეთ ზაფხული
# თუ ეს რიხცვი არის 9, 10, 11 -> დაპრინტეთ



month = int(input("შეიყვანეთ თვე (1-12): "))

if month in (12, 1, 2):
    print("ზამთარი")
elif month in (3, 4, 5):
    print("გაზაფხული")
elif month in (6, 7, 8):
    print("ზაფხული")
elif month in (9, 10, 11):
    print("შემოდგომა")
else:
    print("არასწორი თვეა, უნდა იყოს 1-დან 12-მდე!")
