# 1) შემოატანინეთ მომხმარებელს 3 რიცხვი, შეამოწმეთ:
# თუ 1 და 2 რიცხვი ტოლია -> დაწერეთ 1 და 2 ტოლია
# თუ 1 და 3 რიცხვი ტოლია -> დაწერეთ 1 და 3 ტოლია
# თუ 2და 3 რიცხვი ტოლია -> დაწერეთ 2და 3 ტოლია
# თუ სამივე ტოლია -> დაწერეთ სამივე ტოლია
# თუ არცერთი არ არის ტოლი -> დაწერეთ არცერთი არ არის ტოლია




a = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))
c = int(input("შეიყვანეთ მესამე რიცხვი: "))

if a == b == c:
    print("სამივე ტოლია")
elif a == b:
    print("1 და 2 ტოლია")
elif a == c:
    print("1 და 3 ტოლია")
elif b == c:
    print("2 და 3 ტოლია")
else:
    print("არცერთი არ არის ტოლი")
