# 3) კომენტარებით ახსენით რას აკეთებენ int, str და float ფუნქციები. თითოეულზე გააკეთეთ 3-3 მაგალითი.

# ---------------------------------------
# int() ფუნქცია
# ---------------------------------------
# გარდაქმნის მონაცემს მთელ რიცხვად (integer). 
# ხშირად გამოიყენება, როცა input()–დან მიღებული მონაცემი ტექსტია, 
# მაგრამ გვინდა რიცხვითი ოპერაციების შესრულება.



# ---------------------------------------
# float() ფუნქცია
# ---------------------------------------
# გარდაქმნის მონაცემს წილადოვან რიცხვად (float)
# გამოიყენება როცა გვინდა ათწილადი ოპერაციები ან კონვერტაცია string-დან


# ---------------------------------------
# str() ფუნქცია
# ---------------------------------------
# გარდაქმნის მონაცემს ტექსტად (string)
# საჭიროა როცა გვინდა რიცხვები ან სხვა ტიპის მონაცემები ტექსტთან ერთად გამოვიყენოთ

