# 3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ


# 1) + ოპერატორი (ჯამი) – 5 მაგალითი
print(5 + 3)     
print(10 + 7)    
print(0 + 15)     
print(2 + 4 + 6)  
print(100 + 250) 

# 2) - ოპერატორი (გამოკლება) – 5 მაგალითი
print(10 - 4)    
print(20 - 15)    
print(50 - 25)    
print(7 - 3 - 2)  
print(100 - 55)   

# 3) * ოპერატორი (გამრავლება) – 5 მაგალითი
print(3 * 4)     
print(2 * 6)      
print(5 * 5)     
print(7 * 3) 
print(10 * 8)     
