# 2) მომხმარებელს შემოატანინეთ სახლი, გვარი და ასაკი, თითოეული მათგანი შეინახეთ ცვლადებში(დაგჭირდებათ 3 ცვლადი). ამ ცვლადების გამოყენებით შექმენით წინადადება და დაბეჭდეთ terminal-ში(წინადადების შესაქმნელად დაგჭირდებათ კონკადინახია)


first_name = input("შეიყვანეთ თქვენი სახელი: ") 
last_name = input("შეიყვანეთ თქვენი გვარი: ")    
age = input("შეიყვანეთ თქვენი ასაკი: ")         

sentence = "გამარჯობა! მე მქვია " + first_name + " " + last_name + " და ჩემი ასაკია " + age + " წელი."

print(sentence)
