
# 2) შექმენით len ფუნქციის კლონი. Custom ფუნქციების დახმარებით.
# ანუ უნდა შექმნათ ფუნქცია, რომელსაც გადაეცემა ერთი არგუმენტი, ეს იქნება სია ან string-ი. თქვენი დავალებაა გადაცემული სიის/string-ის სიგრძე ანუ ელემენტთა რაოდენობა დააბრუნოთ.
# შეგიძლიათ შექმნათ ცვლადი, რომელსაც თავიდან გაუტოლებთ 0-ს. შემდეგ for ციკლით გადაუაროთ მიღებულ ელემენტს და დაითვალოთ რამდენი ელემენტია მასში ამ ცვლადის ყოველი იტერაციისას ერთით გაზრდით




def custom_len(data):
    count = 0  # 
    for _ in data: 
        count += 1  
    return count  

my_list = [1, 2, 3, 4, 5]
print(custom_len(my_list))

my_string = "Hello"
print( custom_len(my_string))
