// 1) შექმენი ობიექტი სადაც გექნება გექნება ორი გასაღები, მათი მნიშვნელობა კი იყოს კი შენი საყვარელი მანქანის ბრენდი და მოდელი, დაამატე ახალი გასაღები რომელშიც შეინახავ გამოშვების წელს

const obj = {
    favCarBrand: 'honda civic 2017',
    model: '2017 or 2020'
}

// 2)შექმენი ობიექტი calculator, რომელსაც ექნება მეთოდი add(a, b) და დააბრუნებს ჯამს.

const calculator = {
    add(a,b){
        return a+b
    }
}

// 3) შექმენი ობიექტი user სადაც გექნება name და age. წაშალე age გასაღები და დაამატე weigth


// 4)შექმენი ობიექტი book და შეცვალე მისი title გასაღები.

// 5)შექმენი ობიექტი და გამოიყენე for...in, რომ დაბეჭდო მხოლოდ keys.
