# 1) გადახედეთ შემდეგ რესურსს და გააკეთეთ if/else-ზე რამოდენიმე მაგალითი




print("მოგესალმებით ჩვენს პატარა მაღაზიაში!")
print("ჩვენ გვაქვს ასეთი ნივთები:")
print("1. ლიმონათი - 2₾")
print("2. სენდვიჩი - 5₾")
print("3. ნაყინი - 3₾")

money = float(input("გთხოვთ, ჩაწეროთ თქვენი თანხა (₾): "))

if money >= 5:
    print("თქვენ შეგიძლიათ იყიდოთ სენდვიჩი, ლიმონათი ან ნაყინი!")
elif money >= 3:
    print("თქვენ შეგიძლიათ იყიდოთ ნაყინი ან ლიმონათი!")
elif money >= 2:
    print("თქვენ შეგიძლიათ იყიდოთ მხოლოდ ლიმონათი!")
else:
    print("სამწუხაროდ, თქვენ არ გაქვთ საკმარისი თანხა რაიმეს შესაძენად.")

print("მადლობა, რომ იყავით ჩვენს მაღაზიაში!")
