# 2)კომენტარის სახით ახსენით თუ რითი განსხვავდებიან ერთმანეთისგან სიები და ცვლადები და ასევე დაწერე თუ რაში ვიყენებთ სიებს



# ცვლადი (Variable)
#  არის ერთერთი სახის მეხსიერების ადგილი, სადაც შეგვიძლია დავატოვოთ **ერთი კონკრეტული მნიშვნელობა**.
#  მაგალითად:
#       age = 25         
#       name = "Goga"     
#  ცვლადი გამოიყენება, როცა გვჭირდება ერთი კონკრეტული ინფორმაცია და მასზე მოქმედება მარტივად

# სია (List)
#  არის **მრავალგანზომილებიანი მონაცემთა კონტეინერი**, რომელიც საშუალებას გვაძლევს ერთ ცვლადში შევინახოთ **მრავალი მნიშვნელობა** ერთად.
#  სია შეიძლება შეიცავდეს რიცხვებს, ტექსტს ან სხვადსხვა ტიპის მონაცემებს ერთიანად.
#  მაგალითად:
#       fruits = ["apple", "banana", "orange"]   # სია, რომელიც შეიცავს 3 ხილს
#       numbers = [1, 2, 3, 4, 5]               # სია რიცხვებით
#  სიებს ვიყენებთ:
#      მრავალი მონაცემის შენახვაში ერთ ადგილზე
#      მონაცემებზე გამეორებითი ოპერაციების ჩატარებაში (loop–ების საშუალებით)
#      მონაცემების ჯგუფურად დამუშავებაში (დალაგება, დამატება, წაშლა, შეძენა)
#  სიის მაგალითი ოპერაციისთვის:
#       fruits.append("grape")    
#       numbers[0] = 10          
