#  3) პირველ დავალებაში შექმნილ სიას დაუმატეთ ორი ელემენტი(მაგალითად ორი სახელი) .append ფუნქციის გამოყენებით და ყოველი ცვლილების შემდეგ დაბეჭდეთ განახლებული სია.

# საბოლოოდ ისევ დაბეჭდეთ ამ სიის სიგრძე


my_list = ["ვაშლი", "ბანანი", "საზამთრო", "ანანასი", "მანგო",
           "ვაშლი", "მსხალი", "ბალი", "კივი", "მსხალი"]

my_list.append("თამარ") 
print("სია პირველი დამატების შემდეგ:", my_list)

my_list.append("გიორგი")
print("სია მეორე დამატების შემდეგ:", my_list)

print("სიის საბოლოო სიგრძეა:", len(my_list))
