// 2) შექმენით ობიექტი, სადაც გექნებათ შემდეგი კუთვნილებები: name, age, height.შემდეგ მომხმარებელს შემოატანინეთ ამ ორი კუთვნილებიდან ერთ-ერთი, რომელ კუთვნილებასაც შემოიტანს, იმის მნიშვნელობა დაუბეჭდეთ მომხმარებელს შექმნილი ობიექტიდან.

const person = {
    name: 'ilia',
    age: 18,
    height: 180
}
let proper
// 2) იგივე ობიექტზე, რომელიც პირველი დავალებისას შექმენით, გამოიყენეთ Object.entries() მეთოდი, მიღებულ შედეგს გადაუარეთ for of-ით. საიტერაციო ცვლადი მოცემული იქნება სიის სახით. გაუკეთეთ მას დესტრუქცია და დაბეჭდეთ ტერმინალში შემდეგი სახით:"Key: Value"



// 3) კომენტარებით ახსენით რა არის დესტრუქცია