# 3) ისწავლეთ ყველა შედარების ოპერატორი და გააკეთეთ მაგალითები



# ==  (ტოლობა)
# ამოწმებს, არის თუ არა ორი მნიშვნელობა ერთმანეთის ტოლი.
print(5 == 5)   
print(5 == 3)    


# !=  (არათოლობა)
# ამოწმებს, განსხვავდება თუ არა ორი მნიშვნელობა.
print(10 != 7) 
print(4 != 4)    


# >  (მეტია)
# ამოწმებს, არის თუ არა მარცხენა მხარე უფრო დიდი.
print(7 > 3)  
print(2 > 9)     


# <  (ნაკლებია)
# ამოწმებს, არის თუ არა მარცხენა მხარე უფრო პატარა.
print(3 < 10) 
print(8 < 2)     


# >= (მეტია ან ტოლია)
# True იქნება, თუ მარცხენა მხარე მეტია ან ტოლია.
print(5 >= 5)   
print(9 >= 4) 
print(2 >= 7)    


# <= (ნაკლებია ან ტოლია)
# True იქნება, თუ მარცხენა მხარე ნაკლებია ან ტოლია.
print(4 <= 4)   
print(3 <= 10)   
print(9 <= 2)     