// 5) შექმენით რიცხვების მასივი, შენი დავალებაა დატოვო მხოლოდ ლუწი რიცხვები, შემდგომ დარჩენილი რიცხვები გაამრავლეთ 3 ზე, და საბოლოოდ გაიგეთ მასივში არსებული რიცხვების ჯამი

// ეს ორი დოკუმენტაცია გადმოვიტანე
// array.filter(element => პირობა);

// array.filter(function(element, index, array) {
//     return პირობა;
// });


// როგორ მუშაობს
// filter() გადაუვლის მასივის თითოეულ ელემენტს
// ამოწმებს პირობას
// თუ პირობა აბრუნებს true-ს → ელემენტი დარჩება ახალ მასივში
// თუ false → ელემენტი არ მოხვდება ახალ მასივში
// საწყისი მასივი არ იცვლება

