// 1) შექმენით სია, სადაც შეინახავთ 5 რიცხვს. გაუკეთეთ ამ სიას დესტრუქცია და თითოეული რიცხვი შეინახეთ ხვლადში. შემდეგ დაბეჭდეთ ეს ცვლადები.

const numbers = [10,20,30,40,50]
const [a,b,c,d,e] = numbers
console.log(a)


// 2) შექმენით ობიექტი, სადაც გექნებათ მინიმუმ სამი კუთვნილება.
// გაუკეთეთ ამ ობიექტს დესტრუქცია და წამოიღეთ პირველი და მესამე კუთვნილებები. ასევე მესამე კუთვნილება შეინახეთ სხვა სახელით.დაბეჭდეთ შემდეგ ორივე ცვლადი, რომელიც დესტრუქციისას შექმენით

const person = {
    name: 'ilia'
    age: 15
    city: 'Tbi'
}
// 3) იმავე ობიექტზე გამოიყენეთ დღეს ნასწავლი ყველა ობიექტის მეთოდი და დაბეჭდეთ მათი შედეგები(.keys, .values, .entries)