// 1) მათემატიკური ობიექტის მეშვეობით კონსოლში გამოიტანეთ რიცხვი PI.
console.log(Math.PI);

// 3) let, var, const keyword-ების გამოყენებით შექმენით ცვლადები სადაც შეინახავთ თქვენს შესახებ ინფორმაციას, ხოლო შემდეგ კი ამ ცვლადებით ააწყობთ ერთ დიდ წინადადებას. (გამოიყენეთ literal string მეთოდი)
// ცვლადების შექმნა
let name = "Ilia";       
var age = 15;          
const city = "kvareli";    
let sentence = `I am  ${name}, My Age Is ${age}, And I Live in ${city}.`;
console.log(sentence);

// 5) შექმენით 3 ცვლადი, თითო ცვლადში შეინახავთ განსხვავებული მონაცემთა ტიპის მნიშნელობას, და შემდეგ კი typeof ოპერატორით შეამოწმებთ ამ ცვლადში შენახული მნიშვნელობების მონაცემთა ტიპებს.

let name1 = "ilia";      
let age = 15;             
let isStudent = true;  

console.log(typeof name1);      
console.log(typeof age);      
console.log(typeof isStudent);


// 4) შექმენით 2 ცვლადი. პირველში შეინახება random რიცხვი 1 - 10მდე ხოლო მეორეში random რიცხვი 1 - 30 მდე. თქვენი დავალებაა რომ console-ში გამოიტანოთ პირველი რიცხვი ახარისხებული მეორე რიცხვზე.

// 2) მათემატიკური ობიექტის მეშვეობcით კონსოლში გამოიტანეთ random რიცხვი 1-1000 მდე